#1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк
# и сохраните в переменные, выведите на экран.

#создаем переменные

a = 5
b = True
с = 'Это строка'
d = 5.6
e = [-1,0,-2]

# выводим на печать
print('Я целое число: ', a)
print('Я переменная логического типа: ', b)
print('Я строка: ', с)
print('Я число с плавающей точкой: ', d)
print('Я список: ', e)

#запрашиваем у пользователя числа и строки
a = input('Введите целое число: ')
b = input('Введите строку: ')
c = input('Введите число с плавающей точкой: ')

#выводим на экран
print('Я целое число: ', a)
print('Я строка: ', b)
print('Я число с плавающей точкой: ', с)
